In [1]:
import numpy as np
import pandas as pd

In [6]:
ser1=pd.Series(data=[1,2,3,4,5],index=['India','Pakistan','China','Siri Lanka','Bhutan'] )

In [7]:
ser1

India         1
Pakistan      2
China         3
Siri Lanka    4
Bhutan        5
dtype: int64

In [8]:
ser1['India']

1

In [22]:
from numpy.random import rand

In [18]:
np.random.seed(101)

In [29]:
df = pd.DataFrame(rand(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [33]:
df

          W         X         Y         Z
A  0.442368  0.877587  0.949264  0.478167
B  0.461119  0.637289  0.324608  0.117578
C  0.051101  0.637659  0.812266  0.670260
D  0.651768  0.424569  0.656595  0.209161
E  0.659925  0.529623  0.748520  0.093757

In [41]:
df['X']

A    0.877587
B    0.637289
C    0.637659
D    0.424569
E    0.529623
Name: X, dtype: float64

In [43]:
df[['W','X','Y']]

          W         X         Y
A  0.442368  0.877587  0.949264
B  0.461119  0.637289  0.324608
C  0.051101  0.637659  0.812266
D  0.651768  0.424569  0.656595
E  0.659925  0.529623  0.748520

In [52]:
df['new']=df["X"] + df['Y']

In [53]:
df

          W         X         Y         Z       new
A  0.442368  0.877587  0.949264  0.478167  1.826851
B  0.461119  0.637289  0.324608  0.117578  0.961897
C  0.051101  0.637659  0.812266  0.670260  1.449925
D  0.651768  0.424569  0.656595  0.209161  1.081164
E  0.659925  0.529623  0.748520  0.093757  1.278144

In [54]:
df.drop(columns='new',inplace=True)

In [55]:
df

          W         X         Y         Z
A  0.442368  0.877587  0.949264  0.478167
B  0.461119  0.637289  0.324608  0.117578
C  0.051101  0.637659  0.812266  0.670260
D  0.651768  0.424569  0.656595  0.209161
E  0.659925  0.529623  0.748520  0.093757

In [56]:
df.drop('E',axis=0)

          W         X         Y         Z
A  0.442368  0.877587  0.949264  0.478167
B  0.461119  0.637289  0.324608  0.117578
C  0.051101  0.637659  0.812266  0.670260
D  0.651768  0.424569  0.656595  0.209161

In [57]:
df.shape

(5, 4)

# Selecting rows

In [65]:
df.loc[['A']]

          W         X         Y         Z
A  0.442368  0.877587  0.949264  0.478167

In [63]:
df.iloc[0]

W    0.442368
X    0.877587
Y    0.949264
Z    0.478167
Name: A, dtype: float64

In [66]:
df

          W         X         Y         Z
A  0.442368  0.877587  0.949264  0.478167
B  0.461119  0.637289  0.324608  0.117578
C  0.051101  0.637659  0.812266  0.670260
D  0.651768  0.424569  0.656595  0.209161
E  0.659925  0.529623  0.748520  0.093757

In [68]:
df.loc[['D','E'],['Y','Z'] ]

          Y         Z
D  0.656595  0.209161
E  0.748520  0.093757